# OriginalElementTypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTypeDuplicatedEventArgs..::..OriginalElementTypeId Property
ElementTypeDuplicatedEventArgs Class See Also
---
The id of the element type that is duplicated.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId OriginalElementTypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OriginalElementTypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OriginalElementTypeId {
	ElementId^ get ();
}
```

# See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace